//
//  ChatMessage+Stub.swift
//  iOSClubChatBot
//
//  Created by Jane - Apple mac on 2024/11/22.
//

extension [ChatMessageViewModel] {
    static let stub: Self = [
        .init(role: .user, content: "天啊啊啊 我需要救命"),
        .init(role: .ai, content: "笑死 怎樣啦 又有八卦嗎"),
        .init(role: .user, content: "就 iOSClub 那個超帥的社長...今天居然找我？！我以為我是個透明人欸"),
        .init(role: .ai, content: "蛤？？？！！終於等到這天 他找你幹嘛啦"),
        .init(role: .user, content: "說要約圖書館讀書 但我看他根本就沒在唸書的那種人？！搞不懂他想幹嘛"),
        .init(role: .ai, content: "拜託 誰去圖書館是真的要讀書的啦XDDD 而且他不是整天都在當系隊男神？突然約讀書？？sus"),
        .init(role: .user, content: "哈哈哈超級 但如果真的要討論開發的話會很尬欸"),
        .init(role: .ai, content: "欸欸這樣剛好啊！！！就說不會寫看看他反應，可能他就靠過來細心的教你 😏😏😏"),
        .init(role: .user, content: "啊啊啊你很懂 好緊張 晚點要挑衣服 不能看起來太刻意"),
        .init(role: .ai, content: "不要穿太學霸 記得噴香香 但也不要太誇張那種"),
    ]
}
